{
	"title" : "Blind Walls Route",
	"content" : [
		{
			"type" : "header",
			"content" : "Route navigatie app"
		},
		{
			"type" : "paragraph",
			"content" : "In het tweede jaar van Technische Informatica kregen we als vrije eindopdracht voor Clientside Development om een route navigatie app te maken. De eisen waren dat we gebruik maken van OpenStreetMap en OpenRouteService samen met GPS."
		},
		{
			"type" : "sub_header",
			"content" : "Idee"
		},
		{
			"type" : "paragraph",
			"content" : "In het verleden heb ik wel eens te maken gehad met Blindwalls Gallery, via school, vrienden en de omgeving Breda. Door er ook ooit een route van gevolgd te hebben en rond de tijd van uitgave van het Blind Walls Gallery boek ben ik op dit idee gekomen."
		},
		{
			"type" : "link",
			"content" : "Blind Walls Gallery website|https://blindwalls.gallery/over/"
		},
		{
			"type" : "image",
			"content" : "blindwallsroute/zenkone_lion.jpg"
		},
		{
			"type" : "paragraph",
			"content" : "Route navigatie voor Blindwalls Gallery, dat is het idee, maar de vraag is wat wil je erin hebben. Het was al snel duidelijk dat we gebruik gingen maken van de BlindwallsApi die 2 GET-requests beschikbaar heeft; route en murals get functie."
		},
		{
			"type" : "paragraph",
			"content" : "Daarom hebben we ervoor besloten om sowieso een lijst voor route en murals te maken samen met een detailscherm, waarin alle handige informatie komt te staan. Dit betekent voor de route dat er een lijst is met in aflopende volgorde de murals. Naast dat bedachten we ons dat het leuk was om een beginscherm te hebben waar je op de kaart te zien bent met alle murals erbij."
		},
		{
			"type" : "sub_header",
			"content" : "Ontwerp"
		},
		{
			"type" : "paragraph",
			"content" : "Het ontwerp in het geheel is gebouwd op de data uit 2 API's; BlindWallsApi en OpenRouteService. Dit is te zien aan de opzet van klasses die deze data opslaat. Ten slot is er besloten om gebruik te maken van Android Lifecycle; ViewModels en LiveData, zo dat app efficiënt en snel is. Views worden up to date gehouden aan de hand van de ViewModels, die hun data krijgen van repositories. De keuze voor het weglaten van databases is gemaakt in verband complete afhankelijkheid van de api's."
		},
		{
			"type" : "paragraph",
			"content" : "Blind Walls Route is een van mijn apps waar ik trots op ben, een van de redenen is dat ik hier dingen heb geleerd, mooier en slimmer, zowel in gebruikersvriendelijkheid als code. Al heb ik nog veel te leren en zat er hier tijdsdruk bij, ben ik alsnog blij op de netheid van de code die ik des tijds heb kunnen leveren. Eén voorbeeld hiervan is de werking van Models; Blindwalls en Navigation (OpenRouteService) gedeelte."
		},
		{
			"type" : "paragraph",
			"content" : "Beide werken vanuit hetzelfde principe; data van API in een logische datastructuur zetten met behulp van een repository en een viewmodel om lifecycle te beheren van alles. Hierbij dus gebruik gemaakt van singleton repositories en Android.ViewModels (en LiveData). Met behulp van Postman heb ik bekeken welke informatie belangrijk is en waar het staat. Zo zijn er 2 kanten van data verwerken ontstaan, zie diagrammen hieronder."
		},
		{
			"type" : "image",
			"content" : "blindwallsroute/uml_blindwallsroute_model.jpg"
		},
		{
			"type" : "image",
			"content" : "blindwallsroute/uml_openrouteservice_model.jpg"
		},
		{
			"type" : "paragraph",
			"content" : "Naast dat heb ik besloten de Gps en direction gedeelte samen te wrappen naar Orientation. Waarbij Orientation-Manager/Listener geldt als een methode om Gps/Direction-Manager/Listener samen te pakken. Dit kan je kan zien hoe dit gedaan wordt in de klassediagram hieronder. Hierbij geeft OrientationManager de listeners uit OrientationListener door aan de GpsManager en DirectionManager door die het heeft."
		},
		{
			"type" : "image",
			"content" : "blindwallsroute/uml_orientation_model.jpg"
		},
		{
			"type" : "sub_header",
			"content" : "Design"
		},
		{
			"type" : "paragraph",
			"content" : "Aan de user experience is aandacht gestoken. Door alles toegankelijk en intuïtief te maken ontstond er een gebruikersvriendelijke app. Er zijn nog altijd verbeteringen en afwegingen, maar de app is er goed uitgekomen."
		},
		{
			"type" : "paragraph",
			"content" : "Zo is ervoor gekozen om het begin scherm een kaart te maken met alle Murals erop inclusief locatie aanduiding van de telefoon zelf. Om de overgang van deze weergave naar een andere zo logisch mogelijk te maken, hebben we voor 2 wegen gekozen."
		},
		{
			"type" : "image",
			"content" : "blindwallsroute/homescreen.jpg"
		},
		{
			"type" : "paragraph",
			"content" : "De eerste is een uitbreidbaar menu rechtsonder, deze is normaal gezien collapsed, alleen het menu icoon zichtbaar. Als er op geklikt wordt, verplaatsen zich eerst 2 andere knoppen, waarna alle knoppen uitbreiden met tekst. Je kan ze op dezelfde manier ook weer terug brengen. De andere 2 knoppen brengen je naar de lijst met murals of routes."
		},
		{
			"type" : "image",
			"content" : "blindwallsroute/menu1.jpg"
		},
		{
			"type" : "image",
			"content" : "blindwallsroute/menu2.jpg"
		},
		{
			"type" : "paragraph",
			"content" : "De tweede optie is door op een mural indicatie te klikken op de map. Dit opent de detail activiteit van de mural. Deze twee opties zijn ontstaan omdat een begin scherm zonder kaart en indicatie van plek leeg voelde en andere mogelijkheden te extra. Simpel was de voorkeur."
		},
		{
			"type" : "paragraph",
			"content" : "Zo zijn er nog veel keuzes gemaakt over heel de app heen, kan altijd beter bij nader inzien, maar hier kan je van leren. Alles is te zien in de eindoplevering hieronder."
		},
		{
			"type" : "sub_header",
			"content" : "Eindoplevering"
		},
		{
			"type" : "paragraph",
			"content" : "De eindoplevering was in vorm van een expositie, hiervoor is er een pdf en een expositie video gemaakt. De dag voor de eindoplevering is BlindWallsApi offline gezet. Dit zorgde voor een lastige expositie maar met wat hulp is het gelukt om een replica voor de eindexpositie werkend te krijgen. Dit zorgt ervoor dat er in de pdf niet altijd de meest recente screenshots staan (voorbeeld is paarse statusbar). In de pdf staat alles, alle screenshots en uitleg van functionaliteiten en samenvatting van ontwerp."
		},
		{
			"type" : "pdf",
			"content" : "pdf_bwallsroute_eindexpositie.pdf"
		},
		{
			"type" : "paragraph",
			"content" : "Vervolgens hebben we ook een korte demo video als back-up ervoor gemaakt."
		},
		{
			"type" : "video",
			"content" : "bJtCo_K3BVc"
		},
		{
			"type" : "sub_header",
			"content" : "Slot"
		},
		{
			"type" : "paragraph",
			"content" : "Uiteindelijk is er een mooie app opgezet, die helaas niet bruikbaar is in verband met het offline gaan van de BlindWallsApi. Ik heb hier vooral veel van geleerd, veel kleine dingen, dus ben vooral niet bang om mij vragen te stellen over het project!"
		}
	]
}